import pandas as pd
import smtplib
from email.message import EmailMessage

#to mail
mymail="ieeeihuthessaloniki@gmail.com"
mypassword="password"

#pairnei plhroforiew apo to excel
def getname(i):
    return iloc[i,0]


def getmail(i):

    mail=str(xl.iloc[i,4])
    if mail=="":
        mail="Void"
    return mail

#automail gia antres
def bodyauto():
    body=("""    
Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλητή στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.

Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.

Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:
• AI \& Data
• Software Engineering
• Επικοινωνίες \& IoT
• Αυτοματισμοί \& Κυκλώματα

Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλητής στην κατηγορία Αυτοματισμοί \& Κυκλώματα, καθώς η εμπειρία σας στον τομέα των αυτοματισμών/ενσωματωμένων συστημάτων/ηλεκτρονικών κυκλωμάτων θεωρούμε ότι θα προσέφερε ουσιαστική τεχνική γνώση και επαγγελματικό προσανατολισμό στους φοιτητές μας.

Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένος ομιλητής. 

Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.

Με εκτίμηση,
Βασίλης Καραγιαννίδης
Αντιπρόεδρος IEEE IHU SB Thessaloniki
    
    """)
    return body

def bodyai():
    body=("""
 
 Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλητή στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.

Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.

Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:
• AI \& Data
• Software Engineering
• Επικοινωνίες \& IoT
• Αυτοματισμοί \& Κυκλώματα



Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλητής στην κατηγορία AI \& Data καθώς η ενασχόλησή σας με την Τεχνητή Νοημοσύνη και την ανάλυση δεδομένων, θεωρούμε ότι θα προσέφερε ιδιαίτερη αξία και έμπνευση στους φοιτητές μας.

Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένος ομιλητής. 

Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.


Με εκτίμηση,
Βασίλης Καραγιαννίδης
Αντιπρόεδρος IEEE IHU SB Thessaloniki
    """)
    return body

def bodyiot():
    body=("""

Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλητή στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.

Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.



Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:
• AI \& Data
• Software Engineering
• Επικοινωνίες \& IoT
• Αυτοματισμοί \& Κυκλώματα

Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλητής στην κατηγορία Επικοινωνίες \& IoT καθώς η δραστηριοποίησή σας στον τομέα των δικτύων, των τηλεπικοινωνιών και των IoT συστημάτων συνδέεται άμεσα με τα γνωστικά αντικείμενα του τμήματός μας και θα ενέπνεε τους φοιτητές μας.

Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένος ομιλητής. \[ΚΛΕΙΣΙΜΟ ΠΑΛΙΟΥ Ή ΚΑΙΝΟΥΡΓΙΟΥ!!!!!!!!]

Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.

Με εκτίμηση,
Βασίλης Καραγιαννίδης
Αντιπρόεδρος IEEE IHU SB Thessaloniki
    """)
    return body

def bodysoft():
    body=("""

Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλητή στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.

Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.

Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:
• AI \& Data
• Software Engineering
• Επικοινωνίες \& IoT
• Αυτοματισμοί \& Κυκλώματα

Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλητής στην κατηγορία του Software καθώς η επαγγελματική σας πορεία στον χώρο του Software Development και η εμπειρία σας πιστεύουμε πως θα προσέφερε πρακτική γνώση και πολύτιμες συμβουλές στους συμμετέχοντες.

Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένος ομιλητής. 

Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.


Με εκτίμηση,
Βασίλης Καραγιαννίδης
Αντιπρόεδρος IEEE IHU SB Thessaloniki
    """)
    return body


#automail gia gynaikes
def wauto():
    body="""
    Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλήτρια στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.



Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.



Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:

• AI \& Data

• Software Engineering

• Επικοινωνίες \& IoT

• Αυτοματισμοί \& Κυκλώματα



Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλήτρια στην κατηγορία Αυτοματισμοί \& Κυκλώματα, καθώς η εμπειρία σας στον τομέα των αυτοματισμών/ενσωματωμένων συστημάτων/ηλεκτρονικών κυκλωμάτων θεωρούμε ότι θα προσέφερε ουσιαστική τεχνική γνώση και επαγγελματικό προσανατολισμό στους φοιτητές μας.



Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένοη ομιλήτρια.



Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.



Με εκτίμηση,

Βασίλης Καραγιαννίδης

Αντιπρόεδρος IEEE IHU SB Thessaloniki
    """
    return body

def wai():
    body="""
    Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλήτρια στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.



Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.



Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:

• AI \& Data

• Software Engineering

• Επικοινωνίες \& IoT

• Αυτοματισμοί \& Κυκλώματα



Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλήτρια στην κατηγορία AI \& Data καθώς η ενασχόλησή σας με την \[Τεχνητή Νοημοσύνη και την ανάλυση δεδομένων], θεωρούμε ότι θα προσέφερε ιδιαίτερη αξία και έμπνευση στους φοιτητές μας.



Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένη ομιλητής/ομιλήτρια. 



Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.



Με εκτίμηση,

Βασίλης Καραγιαννίδης

Αντιπρόεδρος IEEE IHU SB Thessaloniki
    """
    return body

def wsoft():
    body=""" 
    Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλήτρια στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.



Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.



Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:

• AI \& Data

• Software Engineering

• Επικοινωνίες \& IoT

• Αυτοματισμοί \& Κυκλώματα



Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλήτρια στην κατηγορία του Software καθώς η επαγγελματική σας πορεία στον χώρο του Software Development και η εμπειρία σας πιστεύουμε πως θα προσέφερε πρακτική γνώση και πολύτιμες συμβουλές στους συμμετέχοντες.



Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένη ομιλήτρια. 



Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.



Με εκτίμηση,

Βασίλης Καραγιαννίδης

Αντιπρόεδρος IEEE IHU SB Thessaloniki

    """
    return body
def wiot():
    body="""
     Εκ μέρους του παραρτήματος IEEE IHU Student Branch του Διεθνές Πανεπιστήμιο της Ελλάδος (ΔΙΠΑΕ) – Τμήμα Μηχανικών Πληροφορικής και Ηλεκτρονικών Συστημάτων (Σίνδος), θα θέλαμε να σας προσκαλέσουμε ως ομιλήτρια στο συνέδριό μας IEET Con 2026, το οποίο θα πραγματοποιηθεί στις 24–25 Απριλίου 2026.



Το IEET Con διοργανώθηκε για πρώτη φορά πέρσι με μεγάλη επιτυχία ως IEET Con 2025, συγκεντρώνοντας φοιτητές, ακαδημαϊκούς και επαγγελματίες από τον χώρο της Πληροφορικής και της Ηλεκτρονικής. Φέτος, το νέο προεδρείο του IEEE IHU SB συνεχίζει δυναμικά τον θεσμό με στόχο να τον αναπτύξει ακόμη περισσότερο.



Το συνέδριο μας περιλαμβάνει τέσσερις βασικές θεματικές ενότητες:

• AI \& Data

• Software Engineering

• Επικοινωνίες \& IoT

• Αυτοματισμοί \& Κυκλώματα



Θα ήταν ιδιαίτερη τιμή για εμάς να συμμετάσχετε ως ομιλήτρια στην κατηγορία Επικοινωνίες \& IoT καθώς η δραστηριοποίησή σας στον τομέα των δικτύων, των τηλεπικοινωνιών και των IoT συστημάτων συνδέεται άμεσα με τα γνωστικά αντικείμενα του τμήματός μας και θα ενέπνεε τους φοιτητές μας.



Θα ήταν χαρά μας να πάρετε μέρος στο συνέδριό μας, εάν θα σας ενδιέφερε, ως προσκεκλημένη ομιλήτρια. 



Είμαστε στη διάθεσή σας για οποιαδήποτε διευκρίνιση και θα χαρούμε ιδιαίτερα να συζητήσουμε περισσότερες λεπτομέρειες.



Με εκτίμηση,

Βασίλης Καραγιαννίδης

Αντιπρόεδρος IEEE IHU SB Thessaloniki
     """
    return body

def sendthemail(body1, subject1, mymail1, mail1):
    msg = EmailMessage()
    msg.set_content(body1)
    msg['Subject'] = subject1
    msg['From'] = mymail1
    msg['To'] = mail1

    try:
        print("Γίνεται σύνδεση στον server...")
        # Σύνδεση στον server της Google με ασφάλεια (SSL) στο port 465
        with smtplib.SMTP_SSL('smtp.gmail.com', 465) as server:
            server.login(mymail1, mypassword)
            server.send_message(msg)

        print("Επιτυχία! Το email στάλθηκε.")

    except Exception as e:
        print(f"Προέκυψε σφάλμα: {e}")

subject = "Πρόσκληση Ομιλίας στο IEET Con 2026 – IEEE IHU SB"

try:
    xl = pd.read_excel("xl.xlsx")
except FileNotFoundError:
    print("File not found")


#edw vazoyme pou meiname, de to ekana dynamiko variomoyn
i=114




print("Μείναμε στο νουμερο " + str(i + 2))


while True:
    if (xl.iloc[i,10]=="TO SEND") and (xl.iloc[i,1]=="ΚΑΘΗΓΗΤΗΣ"):
        mail= str(getmail(i))
        print(mail)
        name = getmail(i)

        if xl.iloc[i,3]=="AI":
            print(" Στέλνω μειλ στον " + xl.iloc[i,0])
            print("Ο τομεας του ειναι ο AI")
            body="Αξιότιμε κύριε " + str(name) + "\n" + bodyai()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif  xl.iloc[i,3]=="Data":
            print(" Στέλνω μειλ στον " + xl.iloc[i,0])
            print("Ο τομεας του ειναι ο AI")
            body = "Αξιότιμε κύριε " + str(name) + "\n" + bodyai()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[i,3]=="Τηλεπικοινωνίες & IOT":
            print(" Στέλνω μειλ στον " + xl.iloc[i, 0])
            print("Ο τομεας του ειναι ο IOT")
            body = "Αξιότιμε κύριε " + str(name) + "\n" + bodyiot()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[i,3]=="Software":
            print(" Στέλνω μειλ στον " + xl.iloc[i, 0])
            print("Ο τομεας του ειναι ο software")
            body = "Αξιότιμε κύριε " + str(name) + "\n" + bodysoft()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[i,3]=="Αυτοματισμοί & Κυκλώματα":
            print(" Στέλνω μειλ στον " + xl.iloc[i, 0])
            print("Ο τομεας του ειναι Αυτοματισμοί & Κυκλώματα")
            body = "Αξιότιμε κύριε " + str(name) + "\n" + bodyauto()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[1,3]=="Undetermined":
            print("Δε γνωριζουμε τον τομεα του")

    elif  (xl.iloc[i,10]=="TO SEND") and (xl.iloc[i,1]=="ΚΑΘΗΓΗΤΡΙΑ"):
        mail = str(getmail(i))
        print(mail)
        name = getmail(i)
        if xl.iloc[i,3]=="AI":
            print(" Στέλνω μειλ στον " + xl.iloc[i,0])
            print("Ο τομεας του ειναι ο AI")
            body="Αξιότιμη κυρία " + str(name) + "\n" + wai()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif  xl.iloc[i,3]=="Data":
            print(" Στέλνω μειλ στον " + xl.iloc[i,0])
            print("Ο τομεας του ειναι ο AI")
            body = "Αξιότιμη κυρία " + str(name) + "\n" + wai()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[i,3]=="Τηλεπικοινωνίες & IOT":
            print(" Στέλνω μειλ στον " + xl.iloc[i, 0])
            print("Ο τομεας του ειναι ο IOT")
            body = "Αξιότιμη κυρία " + str(name) + "\n" + wiot()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[i,3]=="Software":
            print(" Στέλνω μειλ στον " + xl.iloc[i, 0])
            print("Ο τομεας του ειναι ο software")
            body = "Αξιότιμη κυρία " + str(name) + "\n" + wsoft()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[i,3]=="Αυτοματισμοί & Κυκλώματα":
            print(" Στέλνω μειλ στον " + xl.iloc[i, 0])
            print("Ο τομεας του ειναι Αυτοματισμοί & Κυκλώματα")
            body = "Αξιότιμη κυρία " + str(name) + "\n" + wauto()
            xl.iloc[i,10]="invite sent"
            xl.to_excel('xl.xlsx', index=False)
            sendthemail(body, subject, mymail, mail)

        elif xl.iloc[1,3]=="Undetermined":
            print("Δε γνωριζουμε τον τομεα του")


    else:
        print("Το status einai " + str(xl.iloc[i,10]))
        print("Τ νουμερο " + str(i) + " εχει λαβει μειλ")









    while True:
      x=input(str("COntinue? y/n "))
      if x=="n":
       break
      elif x=="y":
        i+=1
        print("Μολισ πηαγμε στο νουμερο " + str(i +2))
        break
      else:
          print("you made a typo. Answer should be y or n")
    if x == "n":
     print("Διακοπή προγράμματος.")
     break